app/controllers/auth/registrations_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2023-10-29 14:30:22.398669"], ["updated_at", "2023-10-29 14:30:22.398669"]]
INSERT INTO "users" ("uid", "encrypted_password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["uid", "markpaul@gmail.com"], ["encrypted_password", "[FILTERED]"], ["email", "markpaul@gmail.com"], ["created_at", "2023-10-29 14:30:22.349437"], ["updated_at", "2023-10-29 14:30:22.349437"]]
---
  def create
    super do |resource|
      if resource.persisted?
        # Create a cart for the new user
        cart = Cart.create(user: resource)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    user_id = params[:id] # Assuming user ID is passed as a parameter
    user = User.find_by(id: user_id)