app/controllers/auth/registrations_controller.rb

  def create
    super do |resource|
      if resource.persisted?
        # Create a cart for the new user
        cart = Cart.create(user: resource)
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["created_at", "2024-02-02 11:00:33.800808"], ["updated_at", "2024-02-02 11:00:33.800808"]]
INSERT INTO "users" ("uid", "encrypted_password", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"