app/controllers/carts_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2023-10-09 20:32:06.805325"], ["updated_at", "2023-10-09 20:32:06.805325"]]
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["cart_id", 3], ["status", "open"], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def create
    @cart = Cart.new(user: current_user)
    if @cart.save
      # Create an order associated with the cart
      @order = @cart.orders.create(status: 'open', user: current_user)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."cart_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["cart_id", 3], ["product_id", 2], ["LIMIT", 1]]
---
  def add_to_cart
    product_id = params[:product_id]
    quantity = params[:quantity].to_i
    # Use the cart associated with the user from the beginning
current_cart = current_user.current_cart


    # Make sure the product exists
    product = Product.find_by(id: product_id)
    unless product
      render json: { error: "Product not found" }, status: :unprocessable_entity
      return
    end

    # Use the cart associated with the user from the beginning
    current_cart = current_user.current_cart

    # Check if the product is already in the cart
    order_item = current_cart.order_items.find_by(product: product)

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["created_at", "2023-10-09 07:01:44.192733"], ["updated_at", "2023-10-09 07:01:44.192733"]]
INSERT INTO "orders" ("user_id", "status", "created_at", "updated_at", "cart_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["status", "open"], ["created_at", "2024-02-02 13:16:51.921362"], ["updated_at", "2024-02-02 13:16:51.921362"], ["cart_id", 3]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."cart_id" = $2 AND "orders"."status" = $3 LIMIT $4  [["user_id", 3], ["cart_id", 3], ["status", "open"], ["LIMIT", 1]]
---
  logger.info "Starting transaction..."

  # Find or create an open order associated with the current cart and user
  order = current_user.orders.find_or_create_by(cart: current_cart, status: 'open')

INSERT INTO "order_items" ("order_id", "product_id", "quantity", "created_at", "updated_at", "cart_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 1], ["product_id", 2], ["quantity", 22], ["created_at", "2023-10-18 19:14:43.848239"], ["updated_at", "2023-10-18 19:14:43.848239"], ["cart_id", 1]]
UPDATE "orders" SET "total_amount" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_amount", "89.97"], ["updated_at", "2024-02-02 13:43:00.343358"], ["id", 2]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 44], ["updated_at", "2023-10-18 19:57:17.607758"], ["id", 2]]
---
  # ...

  # Save the order and the order_item
  unless order.save && order_item.save

SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "markpaulmuthuara3@gmail.com"], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
---
# Save current_user and current_cart
unless current_user.save && current_cart.save
  errors = []
  errors << "User is invalid" if current_user.errors.present?
  errors << "Cart is invalid" if current_cart.errors.present?

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_cart
    # Replace this with your actual logic to retrieve cart contents
    @cart_contents = Cart.find(params[:id])  # Example logic, adjust as needed

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."cart_id" = $1 AND "order_items"."id" IS NULL LIMIT $2  [["cart_id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 2]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 2], ["updated_at", "2024-02-03 18:56:55.593264"], ["id", 1]]
---
  def add_quantity
    cart = current_user.cart
    order_item_id = params[:product_id] # Change the parameter name

    if cart.nil?
      render json: { errors: 'User does not have a cart' }, status: :not_found
      return
    end

    order_item = cart.order_items.find_by(id: order_item_id) # Use the correct parameter name

    if order_item.nil?
      render json: { errors: 'Order item not found in the cart' }, status: :not_found
      return
    end

    new_quantity = params[:quantity].to_i

    # Calculate the updated quantity
    updated_quantity = order_item.quantity + new_quantity

    if updated_quantity < 0
      # If the updated quantity is negative, you might want to handle removal logic here
      order_item.destroy
    else
      # Update the order item's quantity
      order_item.update(quantity: updated_quantity)

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def destroy
    cart_item = current_user.cart.cart_items.find(params[:cart_item_id])

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["order_id", 1], ["product_id", 5], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 2]]
---
  def remove_item
    product_id = params[:product_id]

    # Find the order item for the given product
    order_item = current_user.cart.order_items.find_by(product_id: product_id)

    if order_item
      # If the item is in the cart, destroy it
      order_item.destroy