app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."cart_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."cart_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["cart_id", 3], ["product_id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
INSERT INTO "order_items" ("product_id", "quantity", "created_at", "updated_at", "cart_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 30], ["quantity", 2], ["created_at", "2023-10-18 11:21:11.757247"], ["updated_at", "2023-10-18 11:21:11.757247"], ["cart_id", 2]]
---
  def add_to_cart
    # Retrieve the product_id, quantity, and current_user from the params hash
    product_id = params[:product_id]
    quantity = params[:quantity]
    Rails.logger.info("Current User: #{current_user.inspect}")

    # Find the product
    product = Product.find_by(id: product_id)

    if product.nil?
      # Handle the case where the product doesn't exist
      flash[:error] = "Product not found."
      redirect_to root_path # You can customize this redirect as needed
      return
    end

    # Check if the current user has a cart, and if not, create one
    if current_user.cart.nil?
      current_user.cart = Cart.new
    end

    # Check if the product is already in the cart
    order_item = current_user.cart.order_items.find_by(product_id: product_id)

    if order_item
      # If the product is already in the cart, update its quantity
      order_item.update(quantity: order_item.quantity + quantity.to_i)
    else
      # If the product is not in the cart, create a new order_item
      order_item = current_user.cart.order_items.build(product: product, quantity: quantity)
    end

    # Save the changes to the cart and the order item
    if current_user.save && order_item.save

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
  def add_quantity
    cart_item = current_user.cart.cart_items.find(params[:cart_item_id])

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def destroy
    cart_item = current_user.cart.cart_items.find(params[:cart_item_id])

DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 3]]
---
  def clear_cart
    # Destroy all order items associated with the cart
    order_items.destroy_all