app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."cart_id" = $2 AND "orders"."status" = $3 LIMIT $4  [["user_id", 3], ["cart_id", 3], ["status", "open"], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["order_id", 1], ["product_id", 5], ["LIMIT", 1]]
---
def add_to_cart
  product_id = params[:product_id]
  quantity = params[:quantity].to_i

  # Make sure the product exists
  product = Product.find_by(id: product_id)
  unless product
    render json: { error: "Product not found" }, status: :unprocessable_entity
    return
  end

  # Use the cart associated with the user from the beginning
  current_cart = current_user.current_cart

  # Find or initialize an open order associated with the current cart and user
  order = current_user.orders.find_or_initialize_by(cart: current_cart, status: 'open')

  # Check if the product is already in the cart
  order_item = order.order_items.find_or_initialize_by(product: product)

UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 11], ["updated_at", "2024-02-03 23:34:49.259805"], ["id", 3]]
---
    #   render json: { error: "There was an error adding the product to the cart", errors: errors }, status: :unprocessable_entity
    #   return
    # end
    unless order.save && order_item.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 AND "carts"."user_id" = $2 LIMIT $3  [["id", 3], ["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "markpaulmuthaura1@gmail.com"], ["LIMIT", 1]]
---
  def get_cart
    cart_id = params[:id]
    current_cart = Cart.find_by(id: cart_id, user: current_user)

    unless current_cart
      render json: { error: "Cart not found" }, status: :not_found
      return
    end

    # Optional: Output information about the current cart to the console
    puts "Current Cart: #{current_cart.inspect}"

    cart_data = {
      id: current_cart.id,
      user_id: current_cart.user_id,
      created_at: current_cart.created_at,
      updated_at: current_cart.updated_at,
      order_id: current_cart.order_id