app/models/cart.rb

  def add_product(product_id, quantity)
    # Find the product
    product = Product.find(product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]