app/models/cart.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."cart_id" = $1  [["cart_id", 2]]
---
  def add_product(product_id, quantity, current_user)
    # Find the product
    product = Product.find(product_id)

    # Check if the current user has a cart, and if not, create one
    if current_user.cart.nil?
      current_user.cart = Cart.new
    end

    # Check if the product is already in the cart
    order_item = current_user.cart.order_items.find_by(product_id: product_id)

    if order_item
      # If the product is already in the cart, update its quantity
      order_item.update(quantity: order_item.quantity + quantity.to_i)
    else
      # If the product is not in the cart, create a new order_item
      order_item = current_user.cart.order_items.build(product: product, quantity: quantity)