app/models/order_item.rb

UPDATE "orders" SET "total_amount" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_amount", "89.97"], ["updated_at", "2024-02-02 13:43:00.343358"], ["id", 2]]
---
  def update_order_total_amount
    order.calculate_total_amount
    order.save