app/models/order.rb

  def calculate_total_amount
    self.total_amount = order_items.sum { |item| item.quantity * item.product.price }
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]